DataProcessors/ИмпортОтветаОтПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИмпортОтветаОтПоставщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Рейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рейс</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиПоставщику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияОтПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЛокальногоФормированияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ИмпортОтветаОтПоставщика/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭлементОформления = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Объект.ТабСравнение.Статус");
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Объект.ТабСравнение.Номенклатура");
	//ОтборОформления = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабСравнение.Статус");
	//ОтборОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборОформления.ПравоеЗначение = "Недовоз";
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	//
	//
	//
	//
	
	//
	//
	//МассивИменКолонокДляПодсветки = Новый Массив;
	//Для каждого Стр из Элементы.ТабСравнение.ПодчиненныеЭлементы Цикл
	//	МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
	//КонецЦикла;
	//
	//ЭлементОформленияКрасный = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	//ЭлементОформленияКрасный.Использование = Истина;
	//ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Красный);
	//
	//ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТабСравнение.Статус");
	//ЭлементУсловияКрасный.ПравоеЗначение = "Недовоз"; 
	//ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементУсловияКрасный.Использование  = Истина;
	//
	//Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
	//	ОформляемоеПоле1      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
	//	ОформляемоеПоле1.Использование = Истина;
	//	ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных("ТабСравнение"); 
	//КонецЦикла;
	//
	//
	//ЭлементОформленияГолубой = УсловноеОформление.Элементы.Добавить();
	//ЭлементОформленияГолубой.Использование = Истина;
	//ЭлементОформленияГолубой.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Голубой);
	//
	//ЭлементУсловияГолубой                = ЭлементОформленияГолубой.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловияГолубой.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТабСравнение.Статус");
	//ЭлементУсловияГолубой.ПравоеЗначение = "Излишек"; 
	//ЭлементУсловияГолубой.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементУсловияГолубой.Использование  = Истина;
	//
	//Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
	//	ОформляемоеПоле2      = ЭлементОформленияГолубой.Поля.Элементы.Добавить();
	//	ОформляемоеПоле2.Использование = Истина;
	//	ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных("ТабСравнение");
	//КонецЦикла;
	//
	//
	//
	//ЭлементОформленияЖелтый = УсловноеОформление.Элементы.Добавить();
	//ЭлементОформленияЖелтый.Использование = Истина;
	//ЭлементОформленияЖелтый.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Голубой);
	//
	//ЭлементУсловияГолубой                = ЭлементОформленияЖелтый.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловияГолубой.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТабСравнение.Статус");
	//ЭлементУсловияГолубой.ПравоеЗначение = "Лишняя позиция"; 
	//ЭлементУсловияГолубой.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементУсловияГолубой.Использование  = Истина;
	//
	//Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
	//	ОформляемоеПоле3      = ЭлементОформленияЖелтый.Поля.Элементы.Добавить();
	//	ОформляемоеПоле3.Использование = Истина;
	//	ОформляемоеПоле3.Поле = Новый ПолеКомпоновкиДанных("ТабСравнение");
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МожноВыпускать = Ложь;
	
	//НуТыЧеНеУнывай();
КонецПроцедуры

&НаСервере
Процедура НуТыЧеНеУнывай()
	Ном = Справочники.Номенклатура.НайтиПоКоду("00000867");
	СтрТч = ТабИмпорт.Добавить();
	СтрТч.Номенклатура = Ном;
	СтрТч.Количество = 14;
	СтрТч.Цена = 12;
	
	СтрТч = ТабСравнение.Добавить();
	СтрТч.Номенклатура = Ном;
	СтрТч.ВФайле = 14;
	СтрТч.ВРейсе = 30;
	СтрТч.Цена = 12;
	СтрТч.Статус = "Недовоз";
	
	Рейс = Документы.Рейс.НайтиПоНомеру("000000002", ТекущаяДата());
	
КонецПроцедуры

// ---------------- ВЫБОР ФАЙЛА ----------------
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	ФайлПуть = "";
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Фильтр = "Excel (*.xlsx;*.xls)|*.xlsx;*.xls";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ФайлПуть = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	Импортировать();
КонецПроцедуры

// ---------------- ИМПОРТ ИЗ EXCEL (КЛИЕНТ) ----------------
&НаКлиенте
Процедура Импортировать()
	Если ПустаяСтрока(ФайлПуть) Тогда
		Сообщить("Выберите файл Excel.");
		Возврат;
	КонецЕсли;
	
	Попытка
		ТабИмпорт.Очистить();
		ПрочитатьExcelВТаблицу(ФайлПуть, ТабИмпорт);
	Исключение
		Сообщить("Ошибка импорта Excel: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Рейс) Тогда
		ПересчитатьСравнение(); // сразу посчитаем, если рейс выбран
	КонецЕсли;
КонецПроцедуры

// --- собственно чтение Excel (ищем шапку с '№' и 'Кол-во'/'Цена'/'код') ---
&НаКлиенте
Процедура ПрочитатьExcelВТаблицу(Путь, Таб) Экспорт
	XL = Неопределено;
	Попытка
		XL = Новый COMОбъект("Excel.Application");
		Книга = XL.Workbooks.Open(Путь);
		Лист = Книга.ActiveSheet;
		
		// найдём строку заголовка (ищем "№" и "Кол-во" и "Цена" и "код")
		ЗаголовокСтрока = 0;
		КолКод = 0; КолКолво = 0; КолЦена = 0;
		Для СтрНом = 1 По 50 Цикл // в первых 50 строках
			НашелКол = Ложь; 
			НашелЦена = Ложь; 
			НашелКод = Ложь;
			Для КолНом = 1 По 50 Цикл // ищем в первых 50 колонках плюс правый хвост
				Значен = Лист.Cells(СтрНом, КолНом).Value;
				Если ТипЗнч(Значен) = Тип("Строка") Тогда
					Текст = СтрЗаменить(НРег(Значен), " ", "");
					
					Если НРег(Лев(Текст,6)) = "кол-во" Тогда 
						НашелКол = Истина; 
						КолКолво = КолНом; 
					КонецЕсли;
					
					Если НРег(Лев(Текст,4)) = "цена" Тогда 
						НашелЦена = Истина; 
						КолЦена = КолНом; 
					КонецЕсли;
					
					Если Текст = "код" Тогда 
						НашелКод = Истина; 
						КолКод = КолНом; 
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если НашелКол И НашелЦена И НашелКод Тогда
				ЗаголовокСтрока = СтрНом;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗаголовокСтрока = 0 Тогда
			ВызватьИсключение "Не найдена строка заголовка (Кол-во/Цена/код).";
		КонецЕсли;
		
		// читаем строки ниже заголовка, пока есть код/товар или пока нет полностью пустой строки ~10 подряд
		ПустыхПодряд = 0;
		Для r = ЗаголовокСтрока + 1 По ЗаголовокСтрока + 3000 Цикл
			
			Код = Лист.Cells(r, КолКод).Value;
			Колво = Лист.Cells(r, КолКолво).Value;
			Цена = Лист.Cells(r, КолЦена).Value;
			
			Если Код = Неопределено Тогда
				ПустыхПодряд = ПустыхПодряд + 1;
				Если ПустыхПодряд > 10 Тогда //Было 10
					Прервать; 
				КонецЕсли;
				Продолжить;
			Иначе
				ПустыхПодряд = 0;
			КонецЕсли;
			
			// нормализуем
			КодСтр = ДобавитьНули(Код, 8);
			КолЧисло = НормЧислоExcel(Колво);
			ЦенаЧисло = НормЧислоExcel(Цена);
			
			Если ПустаяСтрока(Код) ИЛИ Код = Неопределено Тогда 
				Продолжить; 
			КонецЕсли;
			
			Если КолЧисло = Неопределено Тогда 
				Продолжить; 
			КонецЕсли;
			
			Нов = ТабИмпорт.Добавить();
			Нов.Номенклатура = ПолучитьНоменкулатура(КодСтр);
			Нов.Количество = КолЧисло;
			Нов.Цена = ?(ЦенаЧисло = Неопределено, 0, ЦенаЧисло);
		КонецЦикла;
		
		Книга.Close(Ложь);
		XL.Quit();
	Исключение
		Если XL <> Неопределено Тогда 
			Попытка 
				XL.Quit(); 
			Исключение 
			КонецПопытки; 
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьНоменкулатура(КодСтр)
	Возврат Справочники.Номенклатура.НайтиПоКоду(КодСтр)	
КонецФункции

Функция ДобавитьНули(Значение, НужнаяДлинаЗначения)
	
	Значение = СтрЗаменить(Формат(Значение, "ЧГ="), " ", "");
	НадоНулей = НужнаяДлинаЗначения - СтрДлина(Значение);
	ВедущиеНули = Формат(0,"ЧЦ="+НадоНулей+";ЧН=; ЧВН=; ЧГ=0");
	Возврат ВедущиеНули + Значение;
	
КонецФункции

&НаКлиенте
Функция НормЧислоExcel(Значение) Экспорт
	Если Значение = Неопределено Тогда 
		Возврат Неопределено; 
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда 
		Возврат Значение; 
	КонецЕсли;
	
	Стр = Строка(Значение);
	Стр = СокрЛП(Стр);
	Стр = СтрЗаменить(Стр, " ", "");
	// заменим запятую на точку для Число()
	Стр = СтрЗаменить(Стр, ",", ".");
	Попытка
		Возврат Число(Стр);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// ---------------- ПОДБОР РЕЙСА ----------------
&НаКлиенте
Процедура ВыбратьРейс(Команда)
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма);
	
	ОткрытьФорму("Документ.Рейс.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма , , , ,ОбработкаВыбора , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ---------------- СРАВНЕНИЕ ----------------
&НаКлиенте
Процедура ПересчитатьСравнение() Экспорт
	
	Если ТабИмпорт.Количество() = 0 ИЛИ ТабРейс.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ЗаполнитьТабРейс(Рейс);
	
	ТабСравнение.Очистить();
	// Индексы по коду для быстрого сравнения
	ИндИмпорт = Новый Соответствие; // Код -> {Qty, Price}
	Для Каждого СтрокаИмпорта Из ТабИмпорт Цикл
		ИндИмпорт.Вставить(СтрокаИмпорта.Номенклатура, Новый Структура("Количество,Цена", СтрокаИмпорта.Количество, СтрокаИмпорта.Цена));
	КонецЦикла;
	
	ИндРейс = Новый Соответствие; // Код -> Qty
	Для Каждого СтрокаРейса Из ТабРейс Цикл
		ИндРейс.Вставить(СтрокаРейса.Номенклатура, СтрокаРейса.Количество);
	КонецЦикла;
	
	// 1) по файлу: лишние/излишек/недовоз/ок
	МожноВыпускать = Истина;
	Для Каждого СтрокаИмпорта Из ТабИмпорт Цикл
		СтрВРейсе = ИндРейс.Получить(СтрокаИмпорта.Номенклатура);
		ВРейсе = ?(СтрВРейсе = Неопределено, 0, СтрВРейсе);
		ВФайле = ?(СтрокаИмпорта.Количество = Неопределено, 0, СтрокаИмпорта.Количество);
		Статус = "";
		Если ВРейсе = 0 Тогда
			Статус = "Лишняя позиция";
			МожноВыпускать = Ложь;
		ИначеЕсли ВФайле > ВРейсе Тогда
			Статус = "Излишек";
			МожноВыпускать = Ложь;
		ИначеЕсли ВФайле < ВРейсе Тогда
			Статус = "Недовоз";
		Иначе
			Статус = "OK";
		КонецЕсли;
		
		НоваяСтрока = ТабСравнение.Добавить();
		НоваяСтрока.Номенклатура = СтрокаИмпорта.Номенклатура;
		НоваяСтрока.ВРейсе = ВРейсе;
		НоваяСтрока.ВФайле = ВФайле;
		НоваяСтрока.Цена = СтрокаИмпорта.Цена;
		НоваяСтрока.Статус = Статус;
	КонецЦикла;
	
	// 2) позиции, которые есть в рейсе, но отсутствуют в файле (недовоз до 0)
	Для Каждого СтрокаРейса Из ТабРейс Цикл
		Если ИндИмпорт.Получить(СтрокаРейса.Номенклатура) = Неопределено Тогда
			НоваяСтрока = ТабСравнение.Добавить();
			НоваяСтрока.Номенклатура = СтрокаРейса.Номенклатура;
			НоваяСтрока.ВРейсе = СтрокаРейса.Количество;
			НоваяСтрока.ВФайле = 0;
			НоваяСтрока.Цена = 0;
			НоваяСтрока.Статус = "Недовоз";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// ---------------- СЕРВЕР: данные по рейсу + подбор ----------------

&НаСервере
Процедура ЗаполнитьТабРейс(РейсСсылка) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Стр.Номенклатура КАК Номенклатура,
	|	СУММА(Стр.Количество) КАК Количество
	|ИЗ
	|	Документ.Рейс.Заказы КАК Рейс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК Стр
	|		ПО Рейс.ЗаказКлиента = Стр.Ссылка
	|			И (Рейс.Ссылка = &Рейс)
	|
	|СГРУППИРОВАТЬ ПО
	|	Стр.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Стр.Номенклатура");
	Запрос.УстановитьПараметр("Рейс", РейсСсылка);
	ТабРейс.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	ПересчитатьСравнение();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
		Возврат;
	КонецЕсли;
	
	Рейс =  Значение; ///Выбранное значение, вернет ссылку (документа в нашем примере)
	
	ЗаполнитьТабРейсы();
	
	Если ЗначениеЗаполнено(Рейс) Тогда
		ПересчитатьСравнение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабРейсы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.Рейс.Заказы КАК РейсЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО РейсЗаказы.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
		|			И (РейсЗаказы.Ссылка = &Рейс)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТабРейс.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Рейс) Тогда
		Сообщить("Выберите рейс."); 
		Возврат;
	КонецЕсли;
	
	Если ТабИмпорт.Количество() = 0 Тогда
		Сообщить("Сначала импортируйте файл."); 
		Возврат;
	КонецЕсли;
	
	СтрокаОшибки = "";
	Для каждого Строка из ТабСравнение Цикл
		Если Строка.ВРейсе < Строка.ВФайле Тогда
			Если СтрокаОшибки = "" Тогда
				СтрокаОшибки = "Нельзя выпутить документы, так как у следующих номенклатур излишек:";
			КонецЕсли;
			СтрокаОшибки = СтрокаОшибки + Символы.ПС + Строка.Номенклатура;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаОшибки <> "" Тогда
		Сообщить(СтрокаОшибки);
		Возврат;
	КонецЕсли;
	
	ВыпуститьДокументыMVP(Рейс);
	
	Сообщить("Документы успешно выпущены!");
КонецПроцедуры


&НаСервере
Процедура ВыпуститьДокументыMVP(СсылкаРейса) Экспорт
	// --- 1. Заказ поставщику (просто набиваем из импорта)
	ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
	ЗаказПоставщику.ЦенаВключаетНДС = Истина;
	ЗаказПоставщику.Валюта = Справочники.Валюты.НайтиПоКоду("643");
	ЗаказПоставщику.Заполнить(Справочники.Партнеры.НайтиПоКоду("00-00000352"));
	ЗаказПоставщику.Дата = ТекущаяДата();
	ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;
	ЗаказПоставщику.ДатаПоступления = ТекущаяДата();
	ЗаказПоставщику.ДатаОтгрузки = ТекущаяДата();
	ЗаказПоставщику.Комментарий = "Создано на основании Рейса № " + Рейс.Номер;
	
	Для Каждого СтрокаИмпорта Из ТабИмпорт Цикл			
		СтрЗП = ЗаказПоставщику.Товары.Добавить();
		СтрЗП.Номенклатура = СтрокаИмпорта.Номенклатура;
		СтрЗП.КоличествоУпаковок   = СтрокаИмпорта.Количество;
		СтрЗП.Количество   = СтрокаИмпорта.Количество;
		СтрЗП.Цена = СтрокаИмпорта.Цена;
		СтрЗП.ДатаПоступления = ТекущаяДата();
		СтрЗП.Склад = ЗаказПоставщику.Склад;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РейсыЗаказы.ЗаказКлиента КАК Заказ
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсыЗаказы
	|ГДЕ
	|	РейсыЗаказы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РейсыЗаказы.ЗаказКлиента.Дата,
	|	РейсыЗаказы.ЗаказКлиента.Номер");
	Запрос.УстановитьПараметр("Ссылка", СсылкаРейса);
	
	ВыборкаЗаказов = Запрос.Выполнить().Выбрать();
	
	// 3.2 Копия остатков импорта для пошагового расхода
	ОстатокИмпорта = Новый Соответствие; // Номенклатура -> КоличествоОсталось
	Для Каждого СтрокаИмпорта Из ТабИмпорт Цикл
		НайденнаяСтрока = ОстатокИмпорта.Получить(СтрокаИмпорта.Номенклатура);
		Если ОстатокИмпорта.Получить(СтрокаИмпорта.Номенклатура) <> Неопределено Тогда
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + СтрокаИмпорта.Количество;
		Иначе
			ОстатокИмпорта.Вставить(СтрокаИмпорта.Номенклатура, СтрокаИмпорта.Количество);
		КонецЕсли;
	КонецЦикла;
	
	// Для реализаций: что реально отгружаем по каждому заказу
	ПодтвержденоПоЗаказам = Новый Соответствие; // Заказ -> Соответствие(Номенклатура -> Количество)
	
	НачатьТранзакцию();
	Попытка
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЗаказПоставщику);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЗаказПоставщику, Истина));
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ЗаказПоставщику.Товары, СтруктураДействий, Неопределено);
		
		ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
		Поступление = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		Поступление.Заполнить(ЗаказПоставщику.Ссылка);
		Поступление.Комментарий = "Создано на основании Рейса № " + Рейс.Номер;
		Поступление.Дата = ТекущаяДата();
		Поступление.Записать(РежимЗаписиДокумента.Проведение);
		
		Пока ВыборкаЗаказов.Следующий() Цикл
			ЗаказОбъект = ВыборкаЗаказов.Заказ.ПолучитьОбъект();
			ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
			// идём по строкам заказа по порядку — расходуем остаток импорта
			Для НомерСтроки = 0 По ЗаказОбъект.Товары.Количество() - 1 Цикл
				СтрокаЗК = ЗаказОбъект.Товары[НомерСтроки];
				
				Если СтрокаЗК.Отменено Тогда
					Продолжить;
				КонецЕсли;
				
				НомЗК = СтрокаЗК.Номенклатура;
				
				ОсталосьПоИмпорту = ОстатокИмпорта.Получить(НомЗК);
				
				Если ОсталосьПоИмпорту = Неопределено Тогда
					// в файле нет такой номенклатуры → отменяем строку
					СтрокаЗК.Отменено = Истина;
					Продолжить;
				КонецЕсли;
				
				Если ОсталосьПоИмпорту <= 0 Тогда
					// импорт по этой номенклатуре уже исчерпан → отменяем строку
					СтрокаЗК.Отменено = Истина;
					Продолжить;
				КонецЕсли;
				
				ЗаказаноВСтроке = СтрокаЗК.Количество;//СтрокаЗК.КоличествоУпаковок;
				
				Если ОсталосьПоИмпорту >= ЗаказаноВСтроке Тогда
					// хватает полностью → отгружаем всё по строке, уменьшаем импорт и идём дальше
					ОсталосьПоИмпорту = ОсталосьПоИмпорту - ЗаказаноВСтроке;
					ОстатокИмпорта.Вставить(НомЗК, ОсталосьПоИмпорту);
					
					// строку не трогаем (заказ выполнится целиком)
					Продолжить;
				Иначе
					// ОсталосьПоИмпорту < ЗаказаноВСтроке → частичный недовоз: делим строку
					Подтверждено = ОсталосьПоИмпорту;
					Недостаёт    = ЗаказаноВСтроке - ОсталосьПоИмпорту;
					
					// 1) исходную строку уменьшаем до подтверждённого количества
					СтрокаЗК.КоличествоУпаковок = Подтверждено;
					СтрокаЗК.Количество = Подтверждено;
					
					// 2) добавляем новую строку на недостающую часть и помечаем её "Отменено"
					НоваяСтрока = ЗаказОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗК,, "КодСтроки");
					НоваяСтрока.КоличествоУпаковок   = Недостаёт;
					НоваяСтрока.Количество   = Недостаёт;
					НоваяСтрока.Отменено = Истина;
					
					// 3) импорт по этой номенклатуре израсходован
					ОстатокИмпорта.Вставить(НомЗК, 0);
					// следующая строка заказа
					Продолжить;
				КонецЕсли;
			КонецЦикла;
			
			Для каждого СтрокаЗаказа Из ЗаказОбъект.Товары Цикл
				СтрокаЗаказа.Склад = ЗаказОбъект.Склад;
				Если СтрокаЗаказа.Отменено Тогда
					СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
				Иначе
					СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				КонецЕсли;
			КонецЦикла;
			
			
			СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЗаказОбъект);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(ЗаказОбъект));
			СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЗаказОбъект, Истина));
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСумму");
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ЗаказОбъект.Товары, СтруктураДействий, Неопределено);
			

			ЗаказОбъект.НеОтгружатьЧастями = Истина;
			ЗаказОбъект.ДатаОтгрузки = ТекущаяДата();
			ЗаказОбъект.ЦенаВключаетНДС = Истина;
			
			СтруктураПараметры = Новый Структура;
			СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
			СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
			СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
			СтруктураПараметры.Вставить("УправляемыеСкидки", Неопределено);
			
			СкидкиНаценкиСервер.Рассчитать(ЗаказОбъект, СтруктураПараметры);
			ЗаказОбъект.СкидкиРассчитаны = Истина;
			
			ЗаказОбъект.Товары.Сортировать("Номенклатура Возр"); 
			// записываем заказ с изменениями
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			Реализация.Заполнить(ЗаказОбъект.Ссылка);
			Реализация.Дата = ТекущаяДата();
			Реализация.Записать(РежимЗаписиДокумента.Проведение);
			
			СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
			СчетФактура.Заполнить(Реализация.Ссылка);
			СчетФактура.Дата = ТекущаяДата();
			СчетФактура.Записать(РежимЗаписиДокумента.Проведение);
			
			Если ЗаказОбъект.ФормаОплаты = Перечисления.ФормыОплаты.Наличная
				И ЗаказОбъект.ЭтапыГрафикаОплаты.Количество() > 0
				И ЗаказОбъект.ЭтапыГрафикаОплаты[0].Сдвиг = 0 Тогда
				ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
				ПКО.Заполнить(Реализация.Ссылка);
				ПКО.Дата = ТекущаяДата();
				ПКО.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
		
		// --- 5. Закрываем рейс датой приёмки
		РейсОбъект = СсылкаРейса.ПолучитьОбъект();
		РейсОбъект.ДатаПринятияОтПоставщика = ТекущаяДата();
		РейсОбъект.Записать();
		
		Рейс = Документы.Рейс.ПустаяСсылка();
		ТабРейс.Очистить();
		ТабИмпорт.Очистить();
		ТабСравнение.Очистить();
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры
